Repository: SoplosLinux/soplos-repo-selector
Catalog: locale/*/LC_MESSAGES/soplos-repo-selector.po
Languages: it, ru

source: Theme '{name}' not found at {path}
it: Tema '{name}' non trovato in {path}
ru: Тема '{name}' не найдена по пути {path}

source: Successfully loaded theme: {name}
it: Tema caricato correttamente: {name}
ru: Тема успешно загружена: {name}

source: Error loading theme '{name}': {err}
it: Errore durante il caricamento del tema '{name}': {err}
ru: Ошибка при загрузке темы '{name}': {err}

source: Error adding custom CSS: {err}
it: Errore nell'aggiunta del CSS personalizzato: {err}
ru: Ошибка при добавлении пользовательского CSS: {err}

source: Shutting down Soplos Repo Selector...
it: Arresto di Soplos Repo Selector...
ru: Завершение работы Soplos Repo Selector...

source: Cleanup warning: {err}
it: Avviso di pulizia: {err}
ru: Предупреждение об очистке: {err}

source: Starting {name} v{ver}...
it: Avvio di {name} v{ver}...
ru: Запуск {name} v{ver}...

source: Application initialization completed
it: Inizializzazione dell'applicazione completata
ru: Инициализация приложения завершена

source: Desktop Environment: {env}
it: Ambiente desktop: {env}
ru: Окружение рабочего стола: {env}

source: Error initializing environment detection: {err}
it: Errore nell'inizializzazione del rilevamento dell'ambiente: {err}
ru: Ошибка инициализации обнаружения окружения: {err}

source: Language initialized: {lang}
it: Lingua inizializzata: {lang}
ru: Язык инициализирован: {lang}

source: Error initializing internationalization: {err}
it: Errore nell'inizializzazione dell'internazionalizzazione: {err}
ru: Ошибка инициализации интернационализации: {err}

source: Theme loaded: {theme}
it: Tema caricato: {theme}
ru: Тема загружена: {theme}

source: Error initializing theming: {err}
it: Errore nell'inizializzazione dei temi: {err}
ru: Ошибка инициализации темы: {err}

source: Error setting application icon: {err}
it: Errore nell'impostazione dell'icona dell'applicazione: {err}
ru: Ошибка установки иконки приложения: {err}

source: Error creating main window: {err}
it: Errore nella creazione della finestra principale: {err}
ru: Ошибка при создании главного окна: {err}

source: Preferences
it: Preferenze
ru: Настройки

source: About
it: Informazioni
ru: О программе

source: Quit
it: Esci
ru: Выход

source: Error setting up application menu: {err}
it: Errore nella configurazione del menu dell'applicazione: {err}
ru: Ошибка настройки меню приложения: {err}

source: Received signal {num}, shutting down...
it: Segnale {num} ricevuto, arresto in corso...
ru: Получен сигнал {num}, завершение...

source: Application error: {err}
it: Errore dell'applicazione: {err}
ru: Ошибка приложения: {err}

source: Global CDN
it: CDN globale
ru: Глобальный CDN

source: Global Mirror
it: Mirror globale
ru: Глобальный зеркальный сервер

source: United States
it: Stati Uniti
ru: США

source: United Kingdom
it: Regno Unito
ru: Великобритания

source: Germany
it: Germania
ru: Германия

source: France
it: Francia
ru: Франция

source: Australia
ru: Австралия

source: Japan
it: Giappone
ru: Япония

source: Brazil
it: Brasile
ru: Бразилия

source: Spain
it: Spagna
ru: Испания

source: Italy
it: Italia
ru: Италия

source: China
it: Cina
ru: Китай

source: Russia
ru: Россия

source: Canada
ru: Канада

source: Ireland
it: Irlanda
ru: Ирландия

source: Netherlands
it: Paesi Bassi
ru: Нидерланды

source: Switzerland
it: Svizzera
ru: Швейцария

source: Unknown
it: Sconosciuto
ru: Неизвестно

source: Global
it: Globale
ru: Глобально

source: Read {count} repositories from {path}
it: Letti {count} repository da {path}
ru: Прочитано {count} репозиториев из {path}

source: Error reading file {path}
it: Errore nella lettura del file {path}
ru: Ошибка при чтении файла {path}

source: Error writing file {path}
it: Errore nella scrittura del file {path}
ru: Ошибка при записи файла {path}

source: File written successfully: {path}
it: File scritto correttamente: {path}
ru: Файл успешно записан: {path}

source: pkexec failed: {stderr}
it: pkexec non riuscito: {stderr}
ru: pkexec завершился с ошибкой: {stderr}

source: All files written successfully (direct move)
it: Tutti i file scritti correttamente (spostamento diretto)
ru: Все файлы успешно записаны (прямое перемещение)

source: pkexec grouped move failed
it: Spostamento raggruppato con pkexec non riuscito
ru: Групповое перемещение через pkexec не удалось

source: All files written successfully (grouped pkexec)
it: Tutti i file scritti correttamente (pkexec raggruppato)
ru: Все файлы успешно записаны (pkexec сгруппировано)

source: Error in grouped write
it: Errore nella scrittura raggruppata
ru: Ошибка при групповой записи

source: Could not create {path}: {err}
it: Impossibile creare {path}: {err}
ru: Не удалось создать {path}: {err}

source: Error getting key info needed for {path}: {err}
it: Errore ottenendo le informazioni della chiave necessarie per {path}: {err}
ru: Ошибка получения информации о ключе, необходимой для {path}: {err}

source: Error extracting key details for {path}: {err}
it: Errore nell'estrazione dei dettagli della chiave per {path}: {err}
ru: Ошибка извлечения данных ключа для {path}: {err}

source: File {path} does not exist
it: Il file {path} non esiste
ru: Файл {path} не существует

source: Error importing key: {err}
it: Errore nell'importazione della chiave: {err}
ru: Ошибка при импорте ключа: {err}

source: Source {path} does not exist
it: La sorgente {path} non esiste
ru: Источник {path} не существует

source: Permission denied creating destination directory {dir}
it: Permesso negato durante la creazione della directory di destinazione {dir}
ru: Нет прав для создания директории назначения {dir}

source: gpg --dearmor failed
it: gpg --dearmor non riuscito
ru: gpg --dearmor завершился с ошибкой

source: Permission denied writing to {path}
it: Permesso negato durante la scrittura in {path}
ru: Нет прав на запись в {path}

source: Error exporting key: {err}
it: Errore nell'esportazione della chiave: {err}
ru: Ошибка при экспорте ключа: {err}

source: Key {path} does not exist
it: La chiave {path} non esiste
ru: Ключ {path} не существует

source: Key referenced in: {list}
it: Chiave riferita in: {list}
ru: Ключ упоминается в: {list}

source: Deleted {path}
it: Eliminato {path}
ru: Удалено {path}

source: Deleted {path} (via pkexec)
it: Eliminato {path} (via pkexec)
ru: Удалено {path} (через pkexec)

source: pkexec rm failed
it: pkexec rm non riuscito
ru: pkexec rm завершился с ошибкой

source: Key {path} not found
it: Chiave {path} non trovata
ru: Ключ {path} не найден

source: Error deleting key: {err}
it: Errore eliminando la chiave: {err}
ru: Ошибка при удалении ключа: {err}

source: Edit Repository
it: Modifica repository
ru: Редактировать репозиторий

source: Add Repository
it: Aggiungi repository
ru: Добавить репозиторий

source: Cancel
it: Annulla
ru: Отмена

source: Save
it: Salva
ru: Сохранить

source: Type:
it: Tipo:
ru: Тип:

source: Binary (deb)
it: Binario (deb)
ru: Бинарный (deb)

source: Source (deb-src)
it: Sorgente (deb-src)
ru: Исходники (deb-src)

source: Distribution:
it: Distribuzione:
ru: Дистрибутив:

source: Components:
it: Componenti:
ru: Компоненты:

source: Signed By (Key):
it: Firmato da (chiave):
ru: Подписано (ключ):

source: Optional (key path or fingerprint)
it: Opzionale (percorso chiave o impronta)
ru: Необязательно (путь к ключу или отпечаток)

source: Comment:
it: Commento:
ru: Комментарий:

source: Welcome
it: Benvenuto
ru: Добро пожаловать

source: Sources Generator
it: Generatore di sorgenti
ru: Генератор источников

source: Repositories
it: Repository
ru: Репозитории

source: GPG Keys
it: Chiavi GPG
ru: GPG-ключи

source: Ready
it: Pronto
ru: Готово

source: Running on {} ({})
it: In esecuzione su {} ({})
ru: Запущено на {} ({})

source: Working...
it: In lavorazione...
ru: Работаю...

source: Edit
it: Modifica
ru: Изменить

source: Delete
it: Elimina
ru: Удалить

source: Welcome to the Advanced Repository Manager for Soplos Linux. This application will help you get started configuring repositories and mirrors for your system.
it: Benvenuto nel Gestore Avanzato dei Repository per Soplos Linux. Questa applicazione ti aiuterà a iniziare la configurazione dei repository e dei mirror per il tuo sistema.
ru: Добро пожаловать в Расширенный менеджер репозиториев для Soplos Linux. Это приложение поможет вам начать настройку репозиториев и зеркал для вашей системы.

source: Use the tabs above to:
it: Usa le schede sopra per:
ru: Используйте вкладки выше для:

source: • Generate optimized repository sources
it: • Generare sorgenti di repository ottimizzate
ru: • Создание оптимизированных источников репозиториев

source: • Find fastest download mirrors
it: • Trovare i mirror di download più veloci
ru: • Поиск самых быстрых зеркал загрузки

source: • Manage repositories and GPG keys
it: • Gestire repository e chiavi GPG
ru: • Управление репозиториями и GPG-ключами

source: • Customize free / non-free components
it: • Personalizzare componenti free / non-free
ru: • Настройка свободных / несвободных компонентов

source: Import Key
it: Importa Chiave
ru: Импорт ключа

source: Refresh
it: Aggiorna
ru: Обновить

source: No GPG keys found
it: Nessuna chiave GPG trovata
ru: GPG-ключи не найдены

source: Export
it: Esporta
ru: Экспорт

source: Import GPG Key
it: Importa Chiave GPG
ru: Импорт GPG-ключа

source: Import
it: Importa
ru: Импорт

source: Import Error
it: Errore di Importazione
ru: Ошибка импорта

source: Export Key
it: Esporta Chiave
ru: Экспорт ключа

source: Export Error
it: Errore di Esportazione
ru: Ошибка экспорта

source: Confirm Delete
it: Conferma Eliminazione
ru: Подтвердите удаление

source: Delete Error
it: Errore di Eliminazione
ru: Ошибка удаления

source: Apply Changes
it: Applica Modifiche
ru: Применить изменения

source: No repositories found
it: Nessun repository trovato
ru: Репозитории не найдены

source: Delete Repository?
it: Eliminare Repository?
ru: Удалить репозиторий?

source: Are you sure you want to delete this repository? {}
it: Sei sicuro di voler eliminare questo repository? {}
ru: Вы уверены, что хотите удалить этот репозиторий? {}

source: Changes Applied
it: Modifiche Applicate
ru: Изменения применены

source: Repositories have been updated successfully.
it: I repository sono stati aggiornati con successo.
ru: Репозитории успешно обновлены.

source: Error Saving
it: Errore Salvataggio
ru: Ошибка сохранения

source: Could not save repositories. Check logs for details.
it: Impossibile salvare i repository. Controlla i log per i dettagli.
ru: Не удалось сохранить репозитории. Проверьте журналы для подробностей.

source: 1. Select Debian Distribution(s)
it: 1. Seleziona Distribuzione/i Debian
ru: 1. Выберите дистрибутив(ы) Debian

source: Include Backports
it: Includi Backports
ru: Включить Backports

source: 2. Select Components
it: 2. Seleziona Componenti
ru: 2. Выберите компоненты

source: Main (Free Software)
it: Main (Software Libero)
ru: Main (Свободное ПО)

source: Contrib (Drivers/Packages relying on non-free)
it: Contrib (Driver/Pacchetti che dipendono da non-free)
ru: Contrib (Драйверы/Пакеты, зависящие от несвободного ПО)

source: Non-Free (Proprietary software)
it: Non-Free (Software proprietario)
ru: Non-Free (Проприетарное ПО)

source: Non-Free Firmware (Hardware support)
it: Non-Free Firmware (Supporto Hardware)
ru: Non-Free Firmware (Поддержка оборудования)

source: 3. Select Mirror
it: 3. Seleziona Mirror
ru: 3. Выберите зеркало

source: Current: {} (Global CDN)
it: Attuale: {} (Global CDN)
ru: Текущее: {} (Глобальный CDN)

source: Find Fastest Mirror
it: Trova Mirror Più Veloce
ru: Найти самое быстрое зеркало

source: Generate Source List
it: Genera Lista Sorgenti
ru: Сгенерировать список источников

source: Testing mirrors...
it: Test mirror in corso...
ru: Тестирование зеркал...

source: {} - {:.2f} MB/s ({} ms)
ru: {} - {:.2f} МБ/с ({} мс)

source: Current: {url} ({country}, {speed:.2f} MB/s)
it: Attuale: {url} ({country}, {speed:.2f} MB/s)
ru: Текущее: {url} ({country}, {speed:.2f} МБ/с)

source: Testing mirrors... This may take a moment.
it: Test mirror in corso... Potrebbe richiedere un momento.
ru: Тестирование зеркал... Это может занять некоторое время.

source: Warning
it: Attenzione
ru: Предупреждение

source: Please select at least one distribution.
it: Seleziona almeno una distribuzione.
ru: Пожалуйста, выберите хотя бы один дистрибутив.

source: Sources Generated
it: Sorgenti Generate
ru: Источники сгенерированы

source: Your sources have been updated successfully.
it: Le tue sorgenti sono state aggiornate con successo.
ru: Ваши источники были успешно обновлены.

source: Error
it: Errore
ru: Ошибка

source: Could not save sources files. Check permissions.
it: Impossibile salvare i file sorgenti. Controlla i permessi.
ru: Не удалось сохранить файлы источников. Проверьте права доступа.
